app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "pass"], ["created_at", Fri, 10 Jan 2014 08:41:59 UTC +00:00], ["title", "New"], ["updated_at", Fri, 10 Jan 2014 08:41:59 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save